In [2]:
import pandas as pd

In [3]:
data = {'Nome': ['Alice', 'João', 'Ana'], 'Idade': [25, 30, 35] }

In [4]:
df = pd.DataFrame(data)             #DataFrame(df) = Tabela

In [5]:
df

    Nome  Idade
0  Alice     25
1   João     30
2    Ana     35

### SELEÇÃO DE COLUNAS

In [6]:
nomeColuna = df['Nome']
nomeColuna

0    Alice
1     João
2      Ana
Name: Nome, dtype: object

In [7]:
df

    Nome  Idade
0  Alice     25
1   João     30
2    Ana     35

### FATIAMENTO DE LINHAS

In [8]:
dfFatia = df[1:3]
dfFatia

   Nome  Idade
1  João     30
2   Ana     35

### CONDICIONAL

In [9]:
dfCondicional = df[df['Idade'] > 30]

In [10]:
dfCondicional

  Nome  Idade
2  Ana     35

In [11]:
df

    Nome  Idade
0  Alice     25
1   João     30
2    Ana     35

### INSERINDO NOVA COLUNA

In [12]:
df['Salário'] = [5000, 3000, 7000]

df

    Nome  Idade  Salário
0  Alice     25     5000
1   João     30     3000
2    Ana     35     7000

### RENOMEAR COLUNA

In [13]:
df = df.rename(columns={'Idade': 'Anos'})
df

    Nome  Anos  Salário
0  Alice    25     5000
1   João    30     3000
2    Ana    35     7000

### REMOVER UMA COLUNA

In [14]:
df = df.drop('Salário', axis=1)
df

    Nome  Anos
0  Alice    25
1   João    30
2    Ana    35